//+=================================================================== 
 // File Lab_App2.cpp
  // Линейная логическая программа
  // Вариант 15
  // Эта программа вычисляет три логические функции
  //
  // F1(x3,x2,x1,x0)=(2,4,6,8,10,12,14)
  // F2(x3,x2,x1,x0)=(2,3,4,5,6,7)
  // F3(x3,x2,x1,x0)=(2,4,6,8,10)
  //
  // (C) Струна В.Р., 2020
  //-===================================================================
#include <stdio.h>
#include <iostream>
#include <iomanip>
#include <locale.h>
using namespace std;
bool x3, x2, x1, x0, f1, f2, f3, f1_a, f2_a, f3_a;

int main()
{
	setlocale(LC_ALL, "Rus");
	printf("\n\t\t(C) Струна В.Р., 2020");
	printf("\n\tВычислить значение логических функций:");
	printf("\n\tF1(x3,x2,x1,x0)=(2,4,6,8,10,12,14)");
	printf("\n\tF2(x3,x2,x1,x0)=(2,3,4,5,6,7)");
	printf("\n\tF3(x3,x2,x1,x0)=(2,4,6,8,10)");
	for (;;)
	{
		printf("\nПожалуйста, введите булевы переменные x3, x2, x1, x0: ");
		cin >> x3 >> x2 >> x1 >> x0;
		//=============================== C ==================================
		f1 = !x0 && (x3|| x1 || x2);
		f2 = !x3 && (x1 || x2);
		f3 = (x3 && !x2 && !x0) || (!x3 && x2 && !x0) || (!x3 && x1 && !x0);//!x0 && (x3 && !x2 || !x3 && x2 || !x3 && x1) = !x0 && (x3 != x2 || !x3 && x1) 
		//============================ Assembler =============================
		// Вычислить функцию f1 = !x0 && (x3 || x1 || x2)
		__asm {
			// (x3 || x1 || x2)
			mov al, x3
			or al, x1
			or al, x2
			// !x0 && (x3 || x1 || x2)
			mov ah, x0
			not ah
			and ah, al
			// ah -> f1_a
			and ah, 1
			mov f1_a, ah
		}
		// Вычислить функцию f2 = !x3 && (x1 || x2)
		__asm {
			//(x1 || x2)
			mov al, x1
			or al, x2
			//!x3 && (x1 || x2)
			mov ah, x3
			not ah
			and ah, al
			// ah -> f2_a
			and ah, 1
			mov f2_a, ah
		}
		// Вычислить функцию f3 = (x3 && !x2 && !x0) || (!x3 && x2 && !x0) || (!x3 && x1 && !x0);
		__asm {
			// (x3 && !x2 && !x0) 
	        mov al, x3
			mov ah, x2
			not ah
			and al, ah
			mov ah, x0
			not ah
			and al, ah
			// (!x3 && x2 && !x0)
			mov bh, x3
			not bh
			and bh, x2
			mov bl, x0
			not bl
			and bh, bl
			// (!x3 && x1 && !x0)
			mov ah, x3
			not ah
			and ah, x1
			mov bl, x0
			not bl
			and ah, bl
			// (x3 && !x2 && !x0) || (!x3 && x2 && !x0) || (!x3 && x1 && !x0)
			or al, bh
			or al, ah
			// al -> f3_a
			and al, 1
			mov f3_a, al
		}
		// Вывод результатов
		int i, j, k, l, m;
		//Преобразовать булевы переменные в двоичные цифры
		i = (int)x3; j = (int)x2; k = (int)x1; l = (int)x0;
		// Преобразовать четыре двоичные цифры в двоичный код
		m = (i << 3) + (j << 2) + (k << 1) + l;
		// Форматный вывод результатов
		cout << "                   ___C++__     ___Asm__" << endl
			<< "Набор" << "  " << setw(2) << "x3" << "x2" << "x1" << "x0"
			<< "    " << "F1 " << "F2 " << "F3 "
			<< "    " << "F1 " << "F2 " << "F3 " << endl;
		cout << "  " << setw(2) << m << "   " << " " << i << " " << j << " " << k << " " << l
			<< "     " << f1 << "  " << f2 << "  " << f3
			<< "      " << f1_a << "  " << f2_a << "  " << f3_a << endl;
	}
}